# CLI tools
brew "git"
brew "git-lfs"
brew "jq"
brew "ripgrep"
brew "tree"
brew "wget"
brew "tmux"
brew "tldr"
brew "node"
brew "swiftlint"
brew "cocoapods"
brew "gh"

# Apps
cask "iterm2"
cask "xcodes-app"
cask "cursor"
cask "codex"
cask "chatgpt"
cask "google-chrome"
cask "eudic"
cask "github"
cask "charles"
cask "lookin"
cask "navicat-premium"
